# Range语句
# 作用：生成指定规则的数字序列
# 用法1：range(end) -> 获取从0开始，到end结束的数字序列不包含end
# . range(3) -> 0,1,2
# 用法2：range(start,end) -> 获取从start开始到end结束的数字序列
# . range(1,4) -> 1,2,3
# 用法3：range(start,end,step) -> 获取从start开始到end结束，step步长的数字序列
# . range(2,10,2) -> 2,4,6,8

# 示例
# 1.计算1-100之间所有奇数之和
total = 0
# ------第一种写法---------
for i in range(1,101):
    if i % 2 == 1: #判断是否为奇数
        total += i
print(f"1-100之间所有奇数之和为：{total}")
print("===================")
# ---------------------------

# -------第二种写法-----------
for i in range(1,101,2):
    total += 1
print(f"1-100之间所有奇数之和为：{total}")
#----------------------------

# 2.计算100-500所有3的倍数之和
for i in range(100,501):
    if i % 3 == 0: total += i
print(f"100-500之间所有3的倍数之和{total}")